#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

stdout:
module.satire_bot.aws_iam_role.assume_role: Refreshing state... [id=iam_for_lambda]
module.satire_bot.aws_iam_role_policy_attachment.basic: Refreshing state... [id=iam_for_lambda-20220403042457231500000001]
module.satire_bot.aws_lambda_function.ping_pong: Refreshing state... [id=ping_pong]
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=dd7d7dee-674b-4701-b711-91270c700004]
module.satire_bot.heroku_build.satire_bot: Refreshing state... [id=2fc02d0d-8e53-44de-8fd4-8722609eee0a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.aws_iam_role.assume_role has changed
  ~ resource "aws_iam_role" "assume_role" {
        id                    = "iam_for_lambda"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ]
        name                  = "iam_for_lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.satire_bot.heroku_build.satire_bot has changed
  ~ resource "heroku_build" "satire_bot" {
        id                = "2fc02d0d-8e53-44de-8fd4-8722609eee0a"
      ~ output_stream_url = "https://build-output.heroku.com/streams/dd/dd7d7dee-674b-4701-b711-91270c700004/logs/2f/2fc02d0d-8e53-44de-8fd4-8722609eee0a.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220403%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220403T042444Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=723052fa231c7a603dd2b91bf944282316db0e250e632ac4f8a0e923a8d92186" -> "https://build-output.heroku.com/streams/dd/dd7d7dee-674b-4701-b711-91270c700004/logs/2f/2fc02d0d-8e53-44de-8fd4-8722609eee0a.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220403%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220403T044442Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=6dac9c8e9a13a95334715131e19610c0f6053e1a265f1a5971b7689cf2bf9219"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.satire_bot.heroku_build.satire_bot must be replaced
-/+ resource "heroku_build" "satire_bot" {
      ~ buildpacks        = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku/go.tgz",
        ] -> (known after apply)
      ~ id                = "2fc02d0d-8e53-44de-8fd4-8722609eee0a" -> (known after apply)
      ~ local_checksum    = "SHA256:60c1c06e438b90f3a628686e53679f654233eddaea15f646f3381c62b8b90274" -> "SHA256:34ae4ea4fc25e521b0a6ebfba678266cf1c5763293e89d5af0dc3e5559ecb3b7" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/dd/dd7d7dee-674b-4701-b711-91270c700004/logs/2f/2fc02d0d-8e53-44de-8fd4-8722609eee0a.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220403%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220403T044442Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=6dac9c8e9a13a95334715131e19610c0f6053e1a265f1a5971b7689cf2bf9219" -> (known after apply)
      ~ release_id        = "fad5f298-9b9b-4aa5-8b19-b791425ad8fb" -> (known after apply)
      ~ slug_id           = "3bcd0143-5ff8-49d6-bad9-5a61d2d3d735" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "lucasyharada@gmail.com"
              - id    = "a3800f25-eaa7-417d-9b9d-5f3b7953685e"
            },
        ] -> (known after apply)
      ~ uuid              = "2fc02d0d-8e53-44de-8fd4-8722609eee0a" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

stderr:

```

</details>

*Pusher: @Adarah, Action: `pull_request`, Working Directory: `infrastructure`, Workflow: `Verify`*